# Задача «Длина слова».
a = 'Привет мир!'
print(len(a))

# Задача «Суммы и разности».
first = 10
second = 7
summa = first + second
diff = first - second
print(summa, diff)

# Задача «Среднее арифметическое».
first = 12
second = 9
third = 15
mean = (first + second + third)//3
print(mean)

# Задача «Простые строчки».
first_string = 'Вторник'
second_string = 'Понедельник'
print(second_string + ', ' + first_string)

# Задача «Сложная формула».
a = 32
b = 21
c = 14
f = (a * b) + (a * c)
print((f**3)/2)